192.168.0.108
spawn ssh -o KexAlgorithms=+diffie-hellman-group1-sha1 -c aes128-cbc,aes192-cbc,3des-cbc,aes256-ctr,aes192-ctr,aes128-ctr,aes256-cbc -x -l sriram 192.168.0.108
sriram@192.168.0.108's password: 

lab-3640>enable
Password: 
lab-3640#
lab-3640#terminal length 0
lab-3640#terminal width 0
lab-3640#show version
Cisco IOS Software, 3600 Software (C3640-IK9O3S-M), Version 12.4(13), RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Thu 22-Feb-07 19:29 by prod_rel_team

ROM: ROMMON Emulation Microcode
ROM: 3600 Software (C3640-IK9O3S-M), Version 12.4(13), RELEASE SOFTWARE (fc1)

lab-3640 uptime is 57 minutes
System returned to ROM by unknown reload cause - suspect boot_data[BOOT_COUNT] 0x0, BOOT_COUNT 0, BOOTDATA 19
System image file is "tftp://255.255.255.255/unknown"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

Cisco 3640 (R4700) processor (revision 0xFF) with 187392K/9216K bytes of memory.
Processor board ID FF1045C5
R4700 CPU at 100MHz, Implementation 33, Rev 1.2
1 FastEthernet interface
DRAM configuration is 64 bits wide with parity enabled.
253K bytes of NVRAM.
8192K bytes of processor board System flash (Read/Write)

Configuration register is 0x2102

lab-3640#show inv
NAME: "3640 chassis", DESCR: "3640 chassis"
PID:                   , VID: 0xFF, SN: FF1045C5   

NAME: "One port Fastethernet TX", DESCR: "One port Fastethernet TX"
PID: NM-1FE-TX=        , VID: 1.0, SN: 7720321    


lab-3640#show run
Building configuration...

Current configuration : 881 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname lab-3640
!
boot-start-marker
boot-end-marker
!
enable password enablesriram
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
ip domain name vsnl.co.in
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
username sriram password 0 sriram
!
!
ip tcp synwait-time 5
! 
!
!
!
!
interface FastEthernet0/0
 ip address 192.168.0.108 255.255.255.0
 duplex auto
 speed auto
!
no ip http server
no ip http secure-server
!
!
!
snmp-server community public RO
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login local
 transport input ssh
!
!
end

lab-3640#show ip int br
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            192.168.0.108   YES NVRAM  up                    up      
lab-3640#
lab-3640#exit
Connection to 192.168.0.108 closed.
